# Конфігурація backend для Terraform
terraform {
  backend "s3" {
    # Ім'я бакета S3, яке використовується для зберігання файлу стану Terraform.
    # Це дозволяє централізовано керувати станом інфраструктури та забезпечує спільний доступ.
    bucket = "diana-terraform-state-bucket-robotdreams"

    # Шлях (ключ) у межах S3 бакета, де буде зберігатися файл стану.
    # Використання структуризованих шляхів допомагає організувати стани для різних середовищ або проектів.
    key = "envs/prod/terraform.tfstate"

    # Регіон, в якому розміщено S3 бакет.
    # Повинен відповідати регіону, в якому ви плануєте розгортати ресурси.
    region = "eu-north-1"

    # Включення шифрування файлу стану, що зберігається у S3 бакеті.
    # Це забезпечує додатковий рівень безпеки для чутливої інформації у файлі стану.
    encrypt = true
  }
}

